// BSLLS:UnusedLocalVariable-off

#Использовать asserts
#Использовать "../src/core"

&Тест
Процедура Должен_ЗапуститьСервисВФонеСОжиданиемИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне() // Устанавливается по умолчанию при создании объекта
		.ОжидатьЗапуск() // Устанавливается по умолчанию при создании объекта
		.Запустить();

	Ожидаем.Что(HttpBin.Запущен(), "Должен быть запущен").ЭтоИстина();

	HttpBin.Остановить();

КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеБезОжиданияИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне() // Устанавливается по умолчанию при создании объекта
		.ОжидатьЗапуск(Ложь)
		.Запустить();

	Приостановить(500);

	Ожидаем.Что(HttpBin.Запущен(), "Должен быть запущен").ЭтоИстина();

	HttpBin.Остановить();

КонецПроцедуры