// BSLLS:UnusedLocalVariable-off

#Использовать asserts
#Использовать "../src/core"

Перем HttpBin; // HttpBin

Процедура ПослеЗапускаТеста() Экспорт
	Если Не HttpBin = Неопределено Тогда
		HttpBin.Остановить();
	КонецЕсли;
КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеСОжиданиемИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне()
		.ОжидатьЗапуск()
		.Запустить();

	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеБезОжиданияИОстановить() Экспорт

	ВремяОжидания = 2000;

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне()
		.ОжидатьЗапуск(Ложь)
		.Запустить();

	Приостановить(ВремяОжидания);

	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры