// BSLLS:UnusedLocalVariable-off

#Использовать asserts
#Использовать ".."

&Тест
Процедура Должен_ЗапуститьСервисВФонеСОжиданиемИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне() // Устанавливается по умолчанию при создании объекта
		.ОжидатьЗапуск() // Устанавливается по умолчанию при создании объекта
		.Запустить()
		.Остановить();

КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеБезОжиданияИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне() // Устанавливается по умолчанию при создании объекта
		.ОжидатьЗапуск(Ложь)
		.Запустить();

	Приостановить(500);

	HttpBin.Остановить();

КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеСОжиданиемИОстановитьЧерезПоделку() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	HttpBin = Новый HttpBin(Поделка)
		.ЗапускатьВФоне() // Устанавливается по умолчанию при создании объекта
		.ОжидатьЗапуск() // Устанавливается по умолчанию при создании объекта
		.Запустить()
		.Остановить();

КонецПроцедуры