// BSLLS:UnusedLocalVariable-off

#Использовать asserts
#Использовать "../src/core"

Перем HttpBin; // HttpBin

Процедура ПослеЗапускаТеста() Экспорт
	Если Не HttpBin = Неопределено Тогда
		HttpBin.Остановить();
	КонецЕсли;
КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеСОжиданиемИОстановить() Экспорт

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне()
		.ОжидатьЗапуск()
		.Запустить();

	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура Должен_ЗапуститьСервисВФонеБезОжиданияИОстановить() Экспорт

	// Подготовка
	ВремяНачалаЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();

	HttpBin = Новый HttpBin()
		.ЗапускатьВФоне()
		.ОжидатьЗапуск()
		.Запустить();

	ВремяЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаЗапуска;

	HttpBin.Остановить();

	Приостановить(200);
	
	// Действие
	HttpBin.ОжидатьЗапуск(Ложь).Запустить();

	Приостановить(ВремяЗапуска);

	// Проверка
	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры