// BSLLS:UnusedLocalVariable-off

#Использовать asserts
#Использовать "../src/core"

Перем HttpBin; // HttpBin

Процедура ПослеЗапускаТеста() Экспорт
	Если Не HttpBin = Неопределено Тогда
		HttpBin.Остановить();
	КонецЕсли;
КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьСервисСинхронноИОстановить() Экспорт

	HttpBin = Новый HttpBin().Запустить();

	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ЗапуститьСервисАсинхронноИОстановить() Экспорт

	// Подготовка
	HttpBin = Новый HttpBin();	
	
	ВремяНачалаЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	HttpBin.Запустить();
	ВремяЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаЗапуска;
	HttpBin.Остановить();

	Приостановить(200);
	
	// Действие
	HttpBin.ЗапуститьАсинх();

	Приостановить(ВремяЗапуска);

	// Проверка
	Ожидаем.Что(HttpBin.Отвечает(), "Должен быть запущен").ЭтоИстина();

КонецПроцедуры